# danmu type

# 小琪Kirit 進入了直播間
# 歡迎老爺: 弦歌一阙半今古 進入直播間
# 歡迎艦長: 波妞丫進入直播間
# regex: (.*?) 進入了直播間
DANMU_ENTER = 1

# 红警三塔防小分队 分享了直播間
# regex: (.*?) 分享了直播間
DANMU_SHARE = 2

# 小零零333 關注了直播間
# 小琪Kirit 相互關注
# regex: (.*?) (關注了直播間|相互關注)
DANMU_FOLLOW = 3

# 收到彈幕: oo小贱霖 說: 电站高地炮台矿重工t2
# regex: 收到彈幕: (.*?) 說: (.*?)
DANMU_SAY = 4

# 收到道具:xxx 贈送的: 辣条 x 1
# regex: 收到道具:(.*?) 贈送的: (.*?) x (.*?)
DANMU_GIFT = 5

# 上船:波妞丫 購買了 舰长 x 1
# 上船:(.*?) 購買了 (.*?) x (.*?)
DANMU_BOARD = 6


TIME_REGEX = r"(\d{1,2}\:\d{1,2}\:\d{1,2}) \: "
DAY_REGEX = r"(\d{4})\-(\d{1,2})\-(\d{1,2})"

DANMU_REGEX = {
    DANMU_ENTER: r"(.*?) 進入了直播間",
    DANMU_SHARE: r"(.*?) 分享了直播間",
    DANMU_FOLLOW: r"(.*?) (關注了直播間|相互關注)",
    DANMU_SAY: r"收到彈幕:(.*?) 說: (.*)",
    DANMU_GIFT: r"收到道具:(.*?) 贈送的: (.*?) x (.*)",
    DANMU_BOARD: r"上船:(.*?) 購買了 (.*?) x (.*)"
}



GOLD_GIFT_DICTS = {
    "吃瓜": 100,
    "冰阔落": 1000,
    "给大佬递茶": 2000,
    "打榜": 2000,
    "B坷垃": 9900,
    "天空之翼": 100000,
    "摩天大楼": 450000,
    "小电视飞船": 1245000,
    "凉了": 100,
    "比心": 520,
    "喵娘": 5200,
    "礼花": 28000,
    "疯狂打call": 52000,
    "节奏风暴": 100000,
}

SILVER_GIFT_DICTS = {
    "辣条": 1,
    "小心心": 50,
}


ABOARD_RANK = {
    "总督": 1,
    "提督": 2,
    "舰长": 3
}