var s5_all_count = 108
var s5_rank_user = ['波妞丫', '无の欢', '红警三塔防小分队', '阔丶先生', '折花载酒z', '今来一扁舟', '_口径即是正义_', '真皮大世界', '云之民', '黎笙1', '大泽南面是我', '西蒙菌', '筱歆L', 'Benny的进程池', 'up都是咕咕精', 'SF-TC星海', '君莫等', '不爱吃零食的天神', '味滋君', '菲劳斯基233']
var s5_gift_counts = [1162, 458, 193, 138, 119, 118, 110, 109, 107, 106, 86, 67, 67, 66, 50, 38, 37, 37, 36, 34]
var s5_rank_gifts =  [ 
    [['辣条', 586], ['凉了', 210], ['小心心', 149], ['吃瓜', 100], ['铃音', 88], ['打榜', 10], ['B坷垃', 8], ['给大佬递茶', 5], ['flag', 3], ['节奏风暴', 2], ['天空之翼', 1]],
    [['辣条', 458]],
    [['小心心', 113], ['辣条', 80]],
    [['吃瓜', 40], ['小心心', 32], ['辣条', 30], ['铃音', 27], ['flag', 4], ['“棋”开得胜', 2], ['打榜', 1], ['冰阔落', 1], ['风吟', 1]],
    [['小心心', 90], ['辣条', 26], ['吃瓜', 2], ['B坷垃', 1]],
] 
