var s6_captain_names = ['波妞丫']
var s6_captain_ranks = ['舰长']
var s6_captain_danmus =  [
    [
        "吓我一跳", "突然听见了哈欠声", "切过来一看黑屏了", "谢谢purple哥送的辣条~", "purple = 紫色，没文化真可怕", "拜拜┏(＾0＾)┛", "晚上好", "一回来就听见电脑在响", "因为你菜带不动呗", "这个游戏除了人机", "能pvp吗", "solo呀", "塔防呀", "反正你虐电也虐不动", "那主播你唱首歌呗", 
        "喊个麦嘛", "你人气330了哈哈哈", "活人出来吱个声", "你每天直播不累吗", "我好贫穷，都只有辣条送", "莫发工资，烦人", "话说你没有没有粉丝牌啊", "你达成五分之一了", "主要还是要多发派森视频", "你为啥不玩玩别的游戏哇", "这个游戏是不是有点小众", "这游戏我看了一个周，没看懂", "感觉有点像EVE", "星际和魔兽我也没玩过，这两个都是在lol之前的",
        "电脑都换不起= =", "这台乞丐mac要把我逼疯了，还买ps", "能玩一点steam上的小游戏……", "一个皮肤一百多", "说别人菜的时候，为啥不反思下自己为啥带不动呢哈哈哈", "哇，又在播", "改行吃播了？", "点歌 像我这样的人", "哈哈哈，这个歌名", "点歌 缘分一道桥", "爽妞晚上好", "你是在打哈欠嘛", "原来我没开声音= =", "点歌 川べりの家", 
        "什么鬼，这不是我点的歌", "浪费了一首歌，伤心", "晚上好~爽妞", "刚睡醒", "音乐压过你的声音了", "点歌 逆战", "话说，你直播间人气快500了耶", "辣条在包裹里面", "银瓜子可以用硬币换", "硬币看视频就有", "可以", "你为啥要换银瓜子", "你为啥换成银瓜子", "辣条又不能换钱", "你送他金瓜子的礼物，爽妞还能加个鸡腿~", "话说你是在跟谁连麦……", "突然进来了好多人，然后人气反而在掉", "我不认识你，也不会看这个直播间", "确实不知道这玩得个啥", "爽妞~我觉得，跟你连麦的小哥哥，声音比你好听", "主播！人家问你问题", "你的字这么小，人家哪里看群名称", "你的声音要睡着了", "点歌好像坏了", "不管用呜呜呜", 
        "点歌 女孩儿与四重奏", "点歌 如果有一天我变得很有钱", "好像只能点两首歌", "你已经用完了额度", "点歌 没有理想的人不伤心", "点歌 474739593", "哈哈哈，一直就是我俩在点", "好困，溜了溜了", "点歌 推开世界的门", "点歌 海阔天空", "在外面，爪机捧场", "太卡了，递个茶撤了，回去用电脑", "晚上好~", "你竟然直播了", 
        "你竟然浪费大好时光在直播", "听姐姐的，全部255 255 255", "我用vs code，就是喜欢那个白色和淡紫色的主题", "不明白为啥你们都用黑色主题", "我觉着你真的用了变声器", "晚上好，我终于搬完了！", "凉了", "怎么不反思下为啥你不能一打二呢→_→", "点歌 逆战", "come on~逆战来也~~~", "点歌 海阔天空", "点歌 给我乖", 
        "打火机的声音", "吃的个啥", "听饿了", "吃播呀~", "啦啦啦，今天好早", "点歌 Apologize", "学英语直播间？", "你还看过入殓师？歌单竟然有", "小伙子不错啊，有品位啊",  
        "然后他开始……", "no one bird you", "好多波浪号，是不是格式不对", "强迫症表示，不能出现波浪号", "因为我就是第300个粉呀~", "恕我直言，病名为穷", "中奖个一个亿，啥对立都没了", "我知道", "你最近所有的动态，基本上都给他有关",  "我关注了你好几次，你回答太多了，把我的timeline占满了", "反复取关，总算你消停了几天", "天天都提示，大爽歌赞同了某回答", "翻了几页，都翻不到别的人了", "用啊人家", "你最近的回答是，学编程是理解就行还是全部背", "我？？？这有啥好回答的", "哈哈哈哈哈", "自己都不好意思念了对吧", "哼，你八月底刚回答了一个", 
        "对，AB都亏了", "你人气好像还涨了，看你写代码多失败，还不如聊天人气多", "╭(╯^╰)╮", "我不信", "我们观察一下未来2分钟的人气", "你看，还跌了5个", "哇，有活人", "老铁点个关注呗", "那个 __main__ 我是今年才知道的", "半路出家的我", "误人子弟", "还好辞职了", "你是不是最近很缺钱", "英语或者粤语", "不不不不，教培行业可挣钱了", "本科学校好可以加分", "但你现在没有名气，别人为什么来教你", "和一个行业结合起来，才有应用的价值", "比如，python+教育；python+金融", "今天还会玩多久哇", "缺点什么味儿~", 
        "点歌 十年", "今天的点歌机不在服务区", "点歌 十年", "看了一个月，还是没看懂这游戏是在干嘛", "也不知道哪个是你，哪个是别个", "也不知道这个游戏怎么下", "辣鸡的我", "红警之家看上去像个病毒网站", "我觉得他口渴了", "哼╭(╯^╰)╮", "点歌 532018", "睡觉觉", "等你赢就天亮了", "今天开始地好早呀~", "不要", 
        "我电脑不行", "不是windows电脑，玩不了", "为啥你直播间人气突然两千多了", "看录像这么吸引观众的吗", "那你岂不是直播间只有几个人", 
    ],
]